### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has been deleted
-   resource "aws_eip" "nat" {
-       allocation_id        = "eipalloc-0e0f1aa360a8919b8" -> null
-       domain               = "vpc" -> null
-       id                   = "eipalloc-0e0f1aa360a8919b8" -> null
-       network_border_group = "ap-northeast-2" -> null
-       public_dns           = "ec2-43-201-133-12.ap-northeast-2.compute.amazonaws.com" -> null
-       public_ip            = "43.201.133.12" -> null
-       public_ipv4_pool     = "amazon" -> null
-       tags                 = {
-           "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all             = {
-           "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
-   resource "aws_internet_gateway" "this" {
-       arn      = "arn:aws:ec2:ap-northeast-2:783857413761:internet-gateway/igw-044d23579483ac58a" -> null
-       id       = "igw-044d23579483ac58a" -> null
        tags     = {
            "Name"        = "jingood2-dev-vpc"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] has been deleted
-   resource "aws_nat_gateway" "this" {
-       allocation_id        = "eipalloc-0e0f1aa360a8919b8" -> null
-       connectivity_type    = "public" -> null
-       id                   = "nat-08e7812225c8c7583" -> null
-       network_interface_id = "eni-06695b8365e38b53b" -> null
-       private_ip           = "10.0.101.226" -> null
-       public_ip            = "43.201.133.12" -> null
-       subnet_id            = "subnet-0e439a3921ae2fd57" -> null
-       tags                 = {
-           "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all             = {
-           "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] has been deleted
-   resource "aws_route" "private_nat_gateway" {
-       destination_cidr_block = "0.0.0.0/0" -> null
-       id                     = "r-rtb-0afa1b5f1d7a299721080289494" -> null
-       nat_gateway_id         = "nat-08e7812225c8c7583" -> null
-       origin                 = "CreateRoute" -> null
-       route_table_id         = "rtb-0afa1b5f1d7a29972" -> null
-       state                  = "active" -> null

-       timeouts {
-           create = "5m" -> null
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
-   resource "aws_route" "public_internet_gateway" {
-       id                     = "r-rtb-09172360da1211f121080289494" -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] has been deleted
-   resource "aws_route_table" "private" {
-       arn              = "arn:aws:ec2:ap-northeast-2:783857413761:route-table/rtb-0afa1b5f1d7a29972" -> null
-       id               = "rtb-0afa1b5f1d7a29972" -> null
-       owner_id         = "783857413761" -> null
-       propagating_vgws = [] -> null
-       route            = [] -> null
-       tags             = {
-           "Name"        = "jingood2-dev-vpc-private"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all         = {
-           "Name"        = "jingood2-dev-vpc-private"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id           = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_route_table.public[0] has been deleted
-   resource "aws_route_table" "public" {
-       arn              = "arn:aws:ec2:ap-northeast-2:783857413761:route-table/rtb-09172360da1211f12" -> null
-       id               = "rtb-09172360da1211f12" -> null
-       owner_id         = "783857413761" -> null
-       propagating_vgws = [] -> null
-       route            = [] -> null
-       tags             = {
-           "Name"        = "jingood2-dev-vpc-public"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all         = {
-           "Name"        = "jingood2-dev-vpc-public"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id           = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_route_table_association.database[0] has been deleted
-   resource "aws_route_table_association" "database" {
-       id             = "rtbassoc-08607e9104af8f032" -> null
-       route_table_id = "rtb-0afa1b5f1d7a29972" -> null
-       subnet_id      = "subnet-0e804f5c60b1cb733" -> null
    }

  # module.vpc.aws_route_table_association.database[1] has been deleted
-   resource "aws_route_table_association" "database" {
-       id             = "rtbassoc-007eb484cc62337dd" -> null
-       route_table_id = "rtb-0afa1b5f1d7a29972" -> null
-       subnet_id      = "subnet-0cb53939aa8306b2a" -> null
    }

  # module.vpc.aws_route_table_association.private[0] has been deleted
-   resource "aws_route_table_association" "private" {
-       id             = "rtbassoc-0a5fcf06e40c0d081" -> null
-       route_table_id = "rtb-0afa1b5f1d7a29972" -> null
-       subnet_id      = "subnet-0a850d550ec704e8d" -> null
    }

  # module.vpc.aws_route_table_association.private[1] has been deleted
-   resource "aws_route_table_association" "private" {
-       id             = "rtbassoc-0d4cfb935dc2414b2" -> null
-       route_table_id = "rtb-0afa1b5f1d7a29972" -> null
-       subnet_id      = "subnet-070a379bc7500b32e" -> null
    }

  # module.vpc.aws_route_table_association.public[0] has been deleted
-   resource "aws_route_table_association" "public" {
-       id             = "rtbassoc-043064efadf2aa472" -> null
-       route_table_id = "rtb-09172360da1211f12" -> null
-       subnet_id      = "subnet-0e439a3921ae2fd57" -> null
    }

  # module.vpc.aws_route_table_association.public[1] has been deleted
-   resource "aws_route_table_association" "public" {
-       id             = "rtbassoc-0a115142b681739c8" -> null
-       route_table_id = "rtb-09172360da1211f12" -> null
-       subnet_id      = "subnet-0eaa1ec2fe184093c" -> null
    }

  # module.vpc.aws_subnet.database[0] has been deleted
-   resource "aws_subnet" "database" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0e804f5c60b1cb733" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2a" -> null
-       availability_zone_id                           = "apne2-az1" -> null
-       cidr_block                                     = "10.0.151.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0e804f5c60b1cb733" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-db-ap-northeast-2a"
-           "Type"        = "Private Database Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-db-ap-northeast-2a"
-           "Type"        = "Private Database Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_subnet.database[1] has been deleted
-   resource "aws_subnet" "database" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0cb53939aa8306b2a" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2c" -> null
-       availability_zone_id                           = "apne2-az3" -> null
-       cidr_block                                     = "10.0.152.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0cb53939aa8306b2a" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-db-ap-northeast-2c"
-           "Type"        = "Private Database Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-db-ap-northeast-2c"
-           "Type"        = "Private Database Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_subnet.private[0] has been deleted
-   resource "aws_subnet" "private" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0a850d550ec704e8d" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2a" -> null
-       availability_zone_id                           = "apne2-az1" -> null
-       cidr_block                                     = "10.0.1.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0a850d550ec704e8d" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-private-ap-northeast-2a"
-           "Type"        = "Private Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-private-ap-northeast-2a"
-           "Type"        = "Private Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_subnet.private[1] has been deleted
-   resource "aws_subnet" "private" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-070a379bc7500b32e" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2c" -> null
-       availability_zone_id                           = "apne2-az3" -> null
-       cidr_block                                     = "10.0.2.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-070a379bc7500b32e" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-private-ap-northeast-2c"
-           "Type"        = "Private Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-private-ap-northeast-2c"
-           "Type"        = "Private Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_subnet.public[0] has been deleted
-   resource "aws_subnet" "public" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0e439a3921ae2fd57" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2a" -> null
-       availability_zone_id                           = "apne2-az1" -> null
-       cidr_block                                     = "10.0.101.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0e439a3921ae2fd57" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-public-ap-northeast-2a"
-           "Type"        = "Public Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-public-ap-northeast-2a"
-           "Type"        = "Public Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_subnet.public[1] has been deleted
-   resource "aws_subnet" "public" {
-       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0eaa1ec2fe184093c" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-northeast-2c" -> null
-       availability_zone_id                           = "apne2-az3" -> null
-       cidr_block                                     = "10.0.102.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0eaa1ec2fe184093c" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "783857413761" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"        = "jingood2-dev-vpc-public-ap-northeast-2c"
-           "Type"        = "Public Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       tags_all                                       = {
-           "Name"        = "jingood2-dev-vpc-public-ap-northeast-2c"
-           "Type"        = "Public Subnets"
-           "environment" = "dev"
-           "owners"      = "jingood2"
        } -> null
-       vpc_id                                         = "vpc-0e8e77d820bf60aa7" -> null
    }

  # module.vpc.aws_vpc.this[0] has been deleted
-   resource "aws_vpc" "this" {
-       arn                              = "arn:aws:ec2:ap-northeast-2:783857413761:vpc/vpc-0e8e77d820bf60aa7" -> null
-       cidr_block                       = "10.0.0.0/16" -> null
-       default_network_acl_id           = "acl-0fffb719b5c0eaf76" -> null
-       default_route_table_id           = "rtb-0a904cd01398b6bf5" -> null
-       default_security_group_id        = "sg-01e077aa151584446" -> null
-       enable_dns_hostnames             = true -> null
-       enable_dns_support               = true -> null
-       id                               = "vpc-0e8e77d820bf60aa7" -> null
-       instance_tenancy                 = "default" -> null
-       main_route_table_id              = "rtb-0a904cd01398b6bf5" -> null
-       owner_id                         = "783857413761" -> null
        tags                             = {
            "Name"        = "jingood2-dev-vpc"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-prod-vpc-ap-northeast-2a"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-prod-vpc-ap-northeast-2a"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"        = "jingood2-prod-vpc"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all = {
+           "Name"        = "jingood2-prod-vpc"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Name"        = "jingood2-prod-vpc-ap-northeast-2a"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all             = {
+           "Name"        = "jingood2-prod-vpc-ap-northeast-2a"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-prod-vpc-private"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-prod-vpc-private"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jingood2-prod-vpc-public"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all         = {
+           "Name"        = "jingood2-prod-vpc-public"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.151.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-db-ap-northeast-2a"
+           "Type"        = "Private Database Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-db-ap-northeast-2a"
+           "Type"        = "Private Database Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.152.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-db-ap-northeast-2c"
+           "Type"        = "Private Database Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-db-ap-northeast-2c"
+           "Type"        = "Private Database Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-private-ap-northeast-2a"
+           "Type"        = "Private Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-private-ap-northeast-2a"
+           "Type"        = "Private Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-private-ap-northeast-2c"
+           "Type"        = "Private Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-private-ap-northeast-2c"
+           "Type"        = "Private Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-public-ap-northeast-2a"
+           "Type"        = "Public Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-public-ap-northeast-2a"
+           "Type"        = "Public Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jingood2-prod-vpc-public-ap-northeast-2c"
+           "Type"        = "Public Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                                       = {
+           "Name"        = "jingood2-prod-vpc-public-ap-northeast-2c"
+           "Type"        = "Public Subnets"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.1.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"        = "jingood2-prod-vpc"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
+       tags_all                             = {
+           "Name"        = "jingood2-prod-vpc"
+           "environment" = "prod"
+           "owners"      = "jingood2"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>